import _jpype
from konlpy.tag import Okt

mz_sum = 0
no_sum = 0
#[단어, mz, not_mz 순]
words = [["ㄹㅇㅋㅋ", 10, 1],
         ["ㄴㅇㄱ", 10, 1],
         ["돔황챠", 10, 1],
         ["가즈아", 10, 1],
         ["시치", 10, 1],
         ["아오", 10, 1],
         ["게이", 10, 1],
         ["틀딱", 10, 1],
         ["대가리", 10, 3],
         ["능지", 10, 2],
         ["섹스", 10, 1],
         ["야스", 10, 1],
         ["개", 8, 4],
         ["미친", 8, 3],
         ["야", 8, 2],
         ["인정", 8, 2],
         ["우와", 8, 2],
         ["헐", 9, 1],
         ["이야", 8, 3],
         ["존나", 8, 2],
         ["병신", 8, 4],
         ["이불킥", 10, 1],
         ["급식", 8, 3],
         ["상남자", 8, 4],
         ["하남자", 10, 1],
         ["ㅍㅌㅊ", 10, 1],
         ["국룰", 10, 1],
         ["여친", 8, 1],
         ["남친", 8, 1],
         ["연애", 7, 2],
         ["야", 8, 3],
         ["아니", 7, 3],
         ["쿨거래", 9, 1],
         ["알빠노", 10, 2],
         ["악플", 9, 3],
         ["먹방", 8, 2],
         ["코노", 10, 1],
         ["인싸", 10, 1],
         ["아잇", 8, 1],
         ["롤", 8 ,1],
         ["게임", 7, 2],
         ["응아니야", 10, 1],
         ["공익", 8, 3],
         ["정공", 9, 2],
         ["ㅈㅈ", 10, 1],
         ["수능", 8, 4],
         ["마라", 9, 1],
         ["레전드", 9, 2],
         ["카톡", 8, 3],
         ["노잼", 9, 1],
         ["꿀잼", 9, 1],
         ["아가리", 8, 3],
         ["갑분싸", 9, 1],
         ["아재개그", 8, 2],
         ["엄", 9, 1],
         ["지렸다", 10, 1],
         ["쌌다", 8, 3],
         ["어쩔티비", 10, 1],
         ["구라", 8, 1],
         ["스트레스", 8, 2],
         ["헐", 8, 1],
         ["대박", 8, 2],
         ["신박한", 8, 2],
         ["기모띠", 10, 1],
         ["MZ", 9, 1],
         ["여러분", 5, 7],
         ["가족", 4, 8],
         ["최고", 3, 8],
         ["홧팅", 1, 9],
         ["늘", 3, 9],
         ["건강", 2 ,9],
         ["평안", 1, 10],
         ["사랑합니다", 1, 10],
         ["건강하세요", 2, 9],
         ["담소", 3, 9],
         ["처리", 4, 6],
         ["해석", 4, 7],
         ["분석", 4, 6],
         ["재롱", 3, 8],
         ["힘내세요", 3, 8],
         ["고맙습니다", 3, 8],
         ["학생", 3, 6],
         ["과제", 5, 5],
         ["제출", 3, 9],
         ["부탁", 4, 7],
         ["제안", 3, 7],
         ["바랍니다", 2, 8],
         ["요소", 3, 7],
         ["세미나", 4, 6],
         ["학회", 3, 8],
         ["경로당", 4, 8],
         ["교수", 4, 8],
         ["도전", 4, 7],
         ["입력", 2, 8],
         ["출력", 3, 7],
         ["교육", 4, 7],
         ["정말", 4, 7],
         ["예약", 4, 6],
         ["착오", 2, 8],
         ["영화관", 4, 7],
         ["상사", 4, 6],
         ["직장", 3, 7],
         ["회사", 4, 5],
         ["수고", 4, 6],
         ["죄송합니다", 5, 7],
         ["잘", 4, 6],
         ["구속", 2, 9],
         ["시켜", 3, 8],
         ["에휴", 4, 8],
         ["루삥뽕", 10, 1],
         ["어쩔",8 ,2],
         ["GOAT", 8 ,1],
         ["손주", 2, 8],
         ["대표", 3, 7],
         ["회장", 3, 7],
         ["소장", 2, 8],
         ["손녀", 2, 8],
         ["진지", 5, 7],
         ["뽕짝", 3, 9],
         ["읍니다", 1, 10],
         ["OTL", 3, 8],
         ["오락", 2, 8]
         ]

mz_sum = 764
no_sum = 526

okt = Okt()
sent = input("문장을 입력하시오 : ")
noun = okt.morphs(sent)

mz_poss = mz_sum / (no_sum + mz_sum)
not_poss = no_sum / (no_sum + mz_sum)
for i in noun:
    for j in words:
        if j[0] == i:
            mz_poss *= j[1]/mz_sum
            not_poss *= j[2]/no_sum
        else:
            mz_poss *= (1 - j[1]/mz_sum)
            not_poss *= (1 - j[2]/no_sum)

print(noun)
poss = mz_poss/(mz_poss+not_poss)
print(poss*100,"%")

if poss > 0.5:
    print("당신은 MZ 입니다")
else:
    print("당신은 MZ가 아닙니다")