import _jpype
from konlpy.tag import Okt
from konlpy.tag import Kkma
kkma = Kkma()
okt = Okt()

bad_sum = 5100
no_bad_sum = 3041

mz_sum = 8861
no_mz_sum = 3628


sosu_zari = 2

single_word_mz_power = [50,60,30,80,90,95]

mz_end_words = ["네", "을걸", "을래", "ㄹ래", "ㄹ걸", "을게", "ㄹ게", "을래", "ㄹ래", "어", "아", "대", "은걸요"]
not_mz_end_words = ["죠","ㄴ가","는가", "읍니다", "군", "군요", "는군", "으마", "마", "구나", "는구나", "으냐", "냐", "느냐", "으랴", "려무나", "소서", "지", "단다", "느냔다", "란다", "잔다", "나", "ㅂ시다","ㅂ니다", "ㄴ걸", "는걸", "은걸","네"]
end_words = []

bad_words =[['개', 120, 40],
            ['개새끼', 27, 2],
            ['거리', 22, 11],
            ['거지', 21, 20],
            ['걸', 29, 38],
            ['것', 48, 74],
            ['게', 32, 24],
            ['게이', 51, 11],
            ['결혼', 22, 17],
            ['곳', 19, 28],
            ['공부', 28, 36],
            ['그', 45, 77],
            ['그게', 23, 24],
            ['그냥', 71, 84],
            ['글', 35, 30],
            ['기술', 19, 20],
            ['김치', 14, 5],
            ['끼리', 14, 13],
            ['나라', 37, 41],
            ['나이', 19, 6],
            ['난', 28, 44],
            ['남', 31, 21],
            ['남자', 31, 26],
            ['녀', 13, 4],
            ['년', 92, 13],
            ['노', 19, 20],
            ['노가다', 22, 6],
            ['놈', 78, 31],
            ['누가', 14, 21],
            ['느금', 111, 1],
            ['느금마', 108, 1],
            ['니', 74, 50],
            ['니애미', 88, 1],
            ['다음', 24, 23],
            ['대가리', 38, 3],
            ['댓글', 20, 17],
            ['데', 24, 26],
            ['도', 16, 16],
            ['뒤질래', 100, 1],
            ['때', 63, 112],
            ['때문', 23, 27],
            ['또', 38, 24],
            ['똥', 20, 3],
            ['머', 17, 10],
            ['머리', 24, 16],
            ['명', 17, 20],
            ['몸', 18, 5],
            ['무슨', 22, 20],
            ['문재인', 16, 6],
            ['문제', 23, 24],
            ['뭐', 76, 92],
            ['뭘', 15, 17],
            ['미국', 25, 21],
            ['바로', 15, 20],
            ['벌레', 16, 2],
            ['병신', 153, 1],
            ['보수', 13, 9],
            ['보지', 26, 5],
            ['북한', 14, 3],
            ['빨', 20, 6],
            ['빨갱이', 20, 0],
            ['사람', 68, 126],
            ['사실', 15, 28],
            ['사진', 12, 23],
            ['사회', 17, 11],
            ['살', 21, 32],
            ['새끼', 307, 6],
            ['생각', 61, 93],
            ['수준', 30, 10],
            ['시발', 77, 1],
            ['쓰레기', 37, 7],
            ['씨발', 93, 1],
            ['씨발롬', 100, 1],
            ['씨벌', 54, 2],
            ['안', 31, 57],
            ['앞', 14, 16],
            ['애미', 84, 49],
            ['여자', 54, 36],
            ['왜', 73, 71],
            ['요즘', 20, 22],
            ['욕', 30, 18],
            ['위', 13, 24],
            ['위장', 5, 1],
            ['응', 10, 100],
            ['응', 18, 10],
            ['이기', 20, 22],
            ['이노', 17, 12],
            ['이상', 17, 23],
            ['이제', 19, 31],
            ['인간', 29, 15],
            ['인생', 25, 14],
            ['일게이', 21, 3],
            ['일베', 50, 32],
            ['일본', 27, 49],
            ['자', 16, 13],
            ['자기', 27, 23],
            ['자살', 54, 6],
            ['자체', 18, 20],
            ['재앙', 21, 2],
            ['쟤', 14, 16],
            ['저', 55, 61],
            ['전', 22, 21],
            ['정도', 35, 59],
            ['정신', 19, 9],
            ['조선', 12, 11],
            ['존나', 183, 13],
            ['좀', 50, 68],
            ['좆', 110, 2],
            ['좌파', 17, 5],
            ['주작', 12, 5],
            ['중국', 19, 29],
            ['지금', 32, 58],
            ['지랄', 92, 1],
            ['직업', 18, 16],
            ['진짜', 83, 21],
            ['질', 20, 10],
            ['집', 25, 39],
            ['짓', 17, 11],
            ['짱깨', 28, 1],
            ['처', 33, 6],
            ['쳐', 68, 34],
            ['충', 19, 9],
            ['친구', 15, 21],
            ['키', 16, 15],
            ['틀', 42, 3],
            ['팩트', 19, 14],
            ['하나', 33, 32],
            ['한국', 48, 44],
            ['한번', 17, 25],
            ['홍어', 31, 3]]
#-----------------------------------------------------------------------------
mz_words = [['GOAT', 300, 1],
            ['MZ', 200, 13],
            ['OTL', 40, 8],
            ['ㄱ', 58, 2],
            ['ㄴㅇㄱ', 300, 1],
            ['ㄹㅇ',239,3],
            ['ㄹㅇㅋㅋ', 300, 1],
            ['ㅈㅈ', 200, 5],
            ['ㅈㄴ', 200, 3],
            ['ㅈㄹ', 189, 3],
            ['ㅈㅅ', 230, 3],
            ['ㅅㄱ', 188, 2],
            ['ㅇ', 123,24],
            ['ㅇㅇ', 231, 2],
            ['ㅇㄷ', 234, 9],
            ['ㅇㅋ', 231, 12],
            ['ㅁㄹ', 178, 14],
            ['ㅉㅉ', 393, 2],
            ['ㅎㅇ', 231, 34],
            ['ㅇㅎ', 212, 3],
            ['몰라', 58, 23],
            ['ㅍㅌㅊ', 100, 1],
            ['가족', 4, 84],
            ['가즈아', 100, 12],
            ['갑분싸', 96, 11],
            ['개', 34, 14],
            ['개그', 24, 83],
            ['건강', 34, 97],
            ['건강하세요', 22, 99],
            ['게이', 100, 14],
            ['게임', 78, 42],
            ['경로당', 43, 84],
            ['고맙습니다', 33, 78],
            ['곱창', 57, 23],
            ['공익', 78, 13],
            ['과제', 35, 53],
            ['교수', 43, 58],
            ['교육', 24, 67],
            ['구라', 88, 1],
            ['구속', 22, 79],
            ['국룰', 100, 3],
            ['급식', 83, 13],
            ['기모띠', 10, 1],
            ['기적', 34, 43],
            ['꿀잼', 79, 13],
            ['남친', 68, 21],
            ['너무', 45, 27],
            ['노잼', 79, 15],
            ['농담', 43, 78],
            ['늘', 13, 89],
            ['능지', 100, 21],
            ['니', 78, 32],
            ['낼', 56, 10],
            ['담소', 13, 92],
            ['대가리', 90, 34],
            ['대박', 38, 62],
            ['대표', 23, 72],
            ['대회', 23, 25],
            ['도전', 24, 78],
            ['돔황챠', 100, 1],
            ['되겠는가', 12, 88],
            ['레전드', 79, 12],
            ['롤', 88, 13],
            ['루삥뽕', 100, 1],
            ['마라', 34, 3],
            ['먹방', 68, 12],
            ['미안', 55, 35],
            ['미쳤다', 58, 52],
            ['미친', 78, 34],
            ['바랍니다', 2, 8],
            ['벗', 3, 56],
            ['병신', 78, 14],
            ['부탁', 4, 7],
            ['분석', 4, 6],
            ['분위기', 47, 45],
            ['뽕짝', 23, 99],
            ['ㅅㅅ',56, 3],
            ['사랑합니다', 19, 90],
            ['상남자', 8, 4],
            ['상사', 4, 6],
            ['샌즈', 10, 1],
            ['세미나', 4, 6],
            ['섹스', 10, 1],
            ['소장', 2, 8],
            ['손녀', 2, 8],
            ['손주', 2, 8],
            ['수고', 4, 6],
            ['수능', 8, 4],
            ['수상', 34, 48],
            ['스트레스', 8, 2],
            ['시치', 10, 1],
            ['시켜', 3, 8],
            ['신박한', 8, 2],
            ['쌌다', 8, 3],
            ['쏘리', 8, 4],
            ['아가리', 8, 3],
            ['아니', 7, 3],
            ['아오', 10, 1],
            ['아잇', 8, 1],
            ['아재개그', 8, 2],
            ['악플', 9, 3],
            ['알빠노', 10, 2],
            ['앞으로', 4, 6],
            ['야', 58, 23],
            ['야스', 100, 14],
            ['어쩔', 78, 12],
            ['어쩔티비', 100, 14],
            ['엄', 59, 9],
            ['엄준식', 98, 1],
            ['에휴', 43, 58],
            ['여러분', 35, 67],
            ['여친', 58, 12],
            ['연애', 52, 22],
            ['영화관', 43, 47],
            ['표', 34, 45],
            ['티켓', 56, 23],
            ['예약', 42, 43],
            ['오락', 2, 8],
            ['오랜', 23, 43],
            ['요소', 3, 7],
            ['우리', 33, 23],
            ['우와', 8, 2],
            ['읍니다', 1, 10],
            ['응아니야', 10, 1],
            ['이불킥', 10, 1],
            ['이야', 8, 3],
            ['인싸', 10, 1],
            ['인정', 8, 2],
            ['입니다', 23, 78],
            ['입력', 2, 8],
            ['잘', 42, 26],
            ['재롱', 23, 78],
            ['적막', 23, 87],
            ['정공', 9, 2],
            ['정말', 3, 8],
            ['제안', 3, 7],
            ['제출', 3, 9],
            ['존나', 78, 12],
            ['죄송합니다', 5, 7],
            ['지렸다', 10, 1],
            ['직장', 3, 7],
            ['진지', 5, 7],
            ['진짜', 7, 3],
            ['착오', 2, 8],
            ['착오', 2, 8],
            ['처리', 4, 6],
            ['최고', 3, 8],
            ['쵝오', 1, 10],
            ['출력', 3, 7],
            ['친구', 64, 33],
            ['카톡', 8, 3],
            ['코노', 10, 1],
            ['쿨거래', 9, 1],
            ['틀딱', 10, 1],
            ['평안', 1, 10],
            ['하겠는가', 2, 8],
            ['하남자', 10, 1],
            ['학생', 3, 6],
            ['학우', 3, 34],
            ['학회', 3, 8],
            ['합니다', 23, 56],
            ['해석', 4, 7],
            ['허허', 1, 9],
            ['헐', 9, 1],
            ['휴', 28, 9],
            ['홧팅', 1, 10],
            ['회사', 24, 35],
            ['회장', 33, 78],
            ['힘내세요', 13, 78],
         ]

def cnt():
    aaa=0
    bbb=0
    for i in bad_words:
        aaa += i[1]
        bbb += i[2]
    print(aaa,bbb)
    aaa=0
    bbb=0
    for i in mz_words:
        aaa += i[1]
        bbb += i[2]
    print(aaa,bbb)

def mz_test_noun(sent):

    noun = okt.morphs(sent)
    
    bad_poss = bad_sum / (no_bad_sum + bad_sum)
    not_bad_poss = bad_sum / (no_bad_sum + bad_sum)

    mz_poss = mz_sum / (no_mz_sum + mz_sum)
    not_mz_poss = no_mz_sum / (no_mz_sum + mz_sum)

    for i in noun:
        for j in bad_words:
            if j[0] == i:
                bad_poss *= j[1]/bad_sum
                not_bad_poss *= j[2]/no_bad_sum
            else:
                bad_poss *= (1 - j[1]/bad_sum)
                not_bad_poss *= (1 - j[2]/no_bad_sum)

        for j in mz_words:
            if j[0] == i:
                    mz_poss *= j[1]/mz_sum
                    not_mz_poss *= j[2]/no_mz_sum
            else:
                mz_poss *= (1 - j[1]/mz_sum)
                not_mz_poss *= (1 - j[2]/no_mz_sum)

    bad_poss = bad_poss/(bad_poss+not_bad_poss)
    mz_poss = mz_poss/(mz_poss+not_mz_poss)

    return max(40, round(bad_poss*100),sosu_zari), round(mz_poss*100, sosu_zari)


def mz_test_endword(sent):

    mz_end_words_cnt = 0
    not_mz_end_words_cnt = 0
    short_ans_cnt = 0

    for i in kkma.pos(sent,flatten=False):
        for j in i:
            if j[0] == 'ㅁ' or j[0] == '음':
                short_ans_cnt += 1
            if j[1][0:2] == 'EF':
                for k in mz_end_words:
                    if j[0] == k:
                        mz_end_words_cnt += 1
                for k in not_mz_end_words:
                    if j[0] == k:
                        not_mz_end_words_cnt += 1

    if short_ans_cnt:
        mz_end_poss = 100
    elif mz_end_words_cnt > not_mz_end_words_cnt:
        mz_end_poss = 90
    elif mz_end_words_cnt < not_mz_end_words_cnt:
        mz_end_poss = 20
    else:
        mz_end_poss = 50
        
    return round(mz_end_poss, sosu_zari)


def word_cnt(sent):
    single_word_cnt = 0
    mz_symbol_cnt = 0
    not_mz_symbol_cnt = 0
    for word in sent:
        if word >= 'ㄱ' and word <= 'ㅎ':
            single_word_cnt += 1
        if word >= 'ㅏ' and word <= 'ㅡ':
            single_word_cnt += 1

        if word == '.' or word == ',' or word == '~' or word == '^' or word == '*':
            not_mz_symbol_cnt += 1
        if word == '?' or word == ';' or word == '(' or word == ')':
            mz_symbol_cnt += 1
    
    if single_word_cnt > 5:
        mz_single_poss = 100

    else:
        mz_single_poss = single_word_mz_power[single_word_cnt]

    mz_symbol_poss=0

    if mz_symbol_cnt > not_mz_symbol_cnt:
        mz_symbol_poss = min(100,50+(mz_symbol_cnt-not_mz_symbol_cnt)*10)
   
    elif mz_symbol_cnt < not_mz_symbol_cnt:
        mz_symbol_poss = max(10,50-(not_mz_symbol_cnt-mz_symbol_cnt)*10)
   
    else:
        mz_symbol_poss = 50

    return mz_single_poss, round(mz_symbol_poss, sosu_zari)

def mz_power(sentence):

    a, b = mz_test_noun(sentence)  
    c = mz_test_endword(sentence)
    d, e = word_cnt(sentence)

    # a = 욕설 사용여부를 통한 MZ력 분석
    # b = MZ한 단어 사용여부를 통한 MZ력 분석
    # c = 종결어미를 통한 MZ력 분석
    # d = 자음이나 모음만 쓰이는 경우를 통한 MZ력 분석
    # e = 특수기호 사용을 통한 MZ력 분석

    return [a, b, c, d, e]

#-------------------------------start-------------------------------
if __name__ == "__main__":
    sentence = input("문장을 입력하시오 : ")
    print(mz_power(sentence))

# print("모든 분석을 통한 당신의 MZ력 : ", round(poss_sum/5,sosu_zari),"%")